zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxEmem_mpu_reg.h
/** \brief C0, EMEM Module Region i Lower Address Register */
#define EMEMMPU0_RGNWRN7_RGNLA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNLA*)0xFB0000C0u)
/** Alias (User Manual Name) for EMEMMPU0_RGNWRN7_RGNLA.
* To use register names with standard convension, please use EMEMMPU0_RGNWRN7_RGNLA.
*/
#define EMEMMPU0_RGNLA7 (EMEMMPU0_RGNWRN7_RGNLA)

/** \brief C4, EMEM Module Region i Upper Address Register */
#define EMEMMPU0_RGNWRN7_RGNUA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNUA*)0xFB0000C4u)
/** Alias (User Manual Name) for EMEMMPU0_RGNWRN7_RGNUA.
* To use register names with standard convension, please use EMEMMPU0_RGNWRN7_RGNUA.
*/
#define EMEMMPU0_RGNUA7 (EMEMMPU0_RGNWRN7_RGNUA)

/** \brief C8, EMEM Module Region i Write Access Enable Register 0 */
#define EMEMMPU0_RGNWRN7_RGNACCENWA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNACCENWA*)0xFB0000C8u)
/** Alias (User Manual Name) for EMEMMPU0_RGNWRN7_RGNACCENWA.
* To use register names with standard convension, please use EMEMMPU0_RGNWRN7_RGNACCENWA.
*/
#define EMEMMPU0_RGNACCENWA7 (EMEMMPU0_RGNWRN7_RGNACCENWA)

/** \brief CC, EMEM Module Region i Write Access Enable Register 1 */
#define EMEMMPU0_RGNWRN7_RGNACCENWB /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNACCENWB*)0xFB0000CCu)
/** Alias (User Manual Name) for EMEMMPU0_RGNWRN7_RGNACCENWB.
* To use register names with standard convension, please use EMEMMPU0_RGNWRN7_RGNACCENWB.
*/
#define EMEMMPU0_RGNACCENWB7 (EMEMMPU0_RGNWRN7_RGNACCENWB)

/** \brief D8, EMEM Module Region i Read Access Enable Register 0 */
#define EMEMMPU0_RGNACCEN0_RGNACCENRA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA*)0xFB0000D8u)
/** Alias (User Manual Name) for EMEMMPU0_RGNACCEN0_RGNACCENRA.
* To use register names with standard convension, please use EMEMMPU0_RGNACCEN0_RGNACCENRA.
*/
#define EMEMMPU0_RGNACCENRA0 (EMEMMPU0_RGNACCEN0_RGNACCENRA)

/** \brief DC, EMEM Module Region i Read Access Enable Register 1 */
#define EMEMMPU0_RGNACCEN0_RGNACCENRB /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB*)0xFB0000DCu)
/** Alias (User Manual Name) for EMEMMPU0_RGNACCEN0_RGNACCENRB.
* To use register names with standard convension, please use EMEMMPU0_RGNACCEN0_RGNACCENRB.
*/
#define EMEMMPU0_RGNACCENRB0 (EMEMMPU0_RGNACCEN0_RGNACCENRB)

/** \brief E8, EMEM Module Region i Read Access Enable Register 0 */
#define EMEMMPU0_RGNACCEN1_RGNACCENRA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA*)0xFB0000E8u)
/** Alias (User Manual Name) for EMEMMPU0_RGNACCEN1_RGNACCENRA.
* To use register names with standard convension, please use EMEMMPU0_RGNACCEN1_RGNACCENRA.
*/
#define EMEMMPU0_RGNACCENRA1 (EMEMMPU0_RGNACCEN1_RGNACCENRA)

/** \brief EC, EMEM Module Region i Read Access Enable Register 1 */
#define EMEMMPU0_RGNACCEN1_RGNACCENRB /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB*)0xFB0000ECu)
/** Alias (User Manual Name) for EMEMMPU0_RGNACCEN1_RGNACCENRB.
* To use register names with standard convension, please use EMEMMPU0_RGNACCEN1_RGNACCENRB.
*/
#define EMEMMPU0_RGNACCENRB1 (EMEMMPU0_RGNACCEN1_RGNACCENRB)

/** \brief F8, EMEM Module Region i Read Access Enable Register 0 */
#define EMEMMPU0_RGNACCEN2_RGNACCENRA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA*)0xFB0000F8u)
/** Alias (User Manual Name) for EMEMMPU0_RGNACCEN2_RGNACCENRA.
* To use register names with standard convension, please use EMEMMPU0_RGNACCEN2_RGNACCENRA.
*/
#define EMEMMPU0_RGNACCENRA2 (EMEMMPU0_RGNACCEN2_RGNACCENRA)

/** \brief FC, EMEM Module Region i Read Access Enable Register 1 */
#define EMEMMPU0_RGNACCEN2_RGNACCENRB /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB*)0xFB0000FCu)
/** Alias (User Manual Name) for EMEMMPU0_RGNACCEN2_RGNACCENRB.
* To use register names with standard convension, please use EMEMMPU0_RGNACCEN2_RGNACCENRB.
*/
#define EMEMMPU0_RGNACCENRB2 (EMEMMPU0_RGNACCEN2_RGNACCENRB)

/** \brief 108, EMEM Module Region i Read Access Enable Register 0 */
#define EMEMMPU0_RGNACCEN3_RGNACCENRA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA*)0xFB000108u)
/** Alias (User Manual Name) for EMEMMPU0_RGNACCEN3_RGNACCENRA.
* To use register names with standard convension, please use EMEMMPU0_RGNACCEN3_RGNACCENRA.
*/
#define EMEMMPU0_RGNACCENRA3 (EMEMMPU0_RGNACCEN3_RGNACCENRA)

/** \brief 10C, EMEM Module Region i Read Access Enable Register 1 */
#define EMEMMPU0_RGNACCEN3_RGNACCENRB /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB*)0xFB00010Cu)
/** Alias (User Manual Name) for EMEMMPU0_RGNACCEN3_RGNACCENRB.
* To use register names with standard convension, please use EMEMMPU0_RGNACCEN3_RGNACCENRB.
*/
#define EMEMMPU0_RGNACCENRB3 (EMEMMPU0_RGNACCEN3_RGNACCENRB)

/** \brief 118, EMEM Module Region i Read Access Enable Register 0 */
#define EMEMMPU0_RGNACCEN4_RGNACCENRA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA*)0xFB000118u)
/** Alias (User Manual Name) for EMEMMPU0_RGNACCEN4_RGNACCENRA.
* To use register names with standard convension, please use EMEMMPU0_RGNACCEN4_RGNACCENRA.
*/
#define EMEMMPU0_RGNACCENRA4 (EMEMMPU0_RGNACCEN4_RGNACCENRA)

/** \brief 11C, EMEM Module Region i Read Access Enable Register 1 */
#define EMEMMPU0_RGNACCEN4_RGNACCENRB /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB*)0xFB00011Cu)
/** Alias (User Manual Name) for EMEMMPU0_RGNACCEN4_RGNACCENRB.
* To use register names with standard convension, please use EMEMMPU0_RGNACCEN4_RGNACCENRB.
*/
#define EMEMMPU0_RGNACCENRB4 (EMEMMPU0_RGNACCEN4_RGNACCENRB)

/** \brief 128, EMEM Module Region i Read Access Enable Register 0 */
#define EMEMMPU0_RGNACCEN5_RGNACCENRA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA*)0xFB000128u)
/** Alias (User Manual Name) for EMEMMPU0_RGNACCEN5_RGNACCENRA.
* To use register names with standard convension, please use EMEMMPU0_RGNACCEN5_RGNACCENRA.
*/
#define EMEMMPU0_RGNACCENRA5 (EMEMMPU0_RGNACCEN5_RGNACCENRA)

