zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxEmem_mpu_reg.h
/** \brief 12C, EMEM Module Region i Read Access Enable Register 1 */
#define EMEMMPU0_RGNACCEN5_RGNACCENRB /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB*)0xFB00012Cu)
/** Alias (User Manual Name) for EMEMMPU0_RGNACCEN5_RGNACCENRB.
* To use register names with standard convension, please use EMEMMPU0_RGNACCEN5_RGNACCENRB.
*/
#define EMEMMPU0_RGNACCENRB5 (EMEMMPU0_RGNACCEN5_RGNACCENRB)

/** \brief 138, EMEM Module Region i Read Access Enable Register 0 */
#define EMEMMPU0_RGNACCEN6_RGNACCENRA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA*)0xFB000138u)
/** Alias (User Manual Name) for EMEMMPU0_RGNACCEN6_RGNACCENRA.
* To use register names with standard convension, please use EMEMMPU0_RGNACCEN6_RGNACCENRA.
*/
#define EMEMMPU0_RGNACCENRA6 (EMEMMPU0_RGNACCEN6_RGNACCENRA)

/** \brief 13C, EMEM Module Region i Read Access Enable Register 1 */
#define EMEMMPU0_RGNACCEN6_RGNACCENRB /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB*)0xFB00013Cu)
/** Alias (User Manual Name) for EMEMMPU0_RGNACCEN6_RGNACCENRB.
* To use register names with standard convension, please use EMEMMPU0_RGNACCEN6_RGNACCENRB.
*/
#define EMEMMPU0_RGNACCENRB6 (EMEMMPU0_RGNACCEN6_RGNACCENRB)

/** \brief 148, EMEM Module Region i Read Access Enable Register 0 */
#define EMEMMPU0_RGNACCEN7_RGNACCENRA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA*)0xFB000148u)
/** Alias (User Manual Name) for EMEMMPU0_RGNACCEN7_RGNACCENRA.
* To use register names with standard convension, please use EMEMMPU0_RGNACCEN7_RGNACCENRA.
*/
#define EMEMMPU0_RGNACCENRA7 (EMEMMPU0_RGNACCEN7_RGNACCENRA)

/** \brief 14C, EMEM Module Region i Read Access Enable Register 1 */
#define EMEMMPU0_RGNACCEN7_RGNACCENRB /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB*)0xFB00014Cu)
/** Alias (User Manual Name) for EMEMMPU0_RGNACCEN7_RGNACCENRB.
* To use register names with standard convension, please use EMEMMPU0_RGNACCEN7_RGNACCENRB.
*/
#define EMEMMPU0_RGNACCENRB7 (EMEMMPU0_RGNACCEN7_RGNACCENRB)

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Emem_mpu_Registers_Cfg_Ememmpu1
 * \{  */
/** \brief 0, EMEM Module Clock Control Register */
#define EMEMMPU1_CLC /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_CLC*)0xFB010000u)

/** \brief 8, EMEM Module ID Register */
#define EMEMMPU1_MODID /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_MODID*)0xFB010008u)

/** \brief 10, EMEM Module Access Enable Register 0 */
#define EMEMMPU1_ACCEN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_ACCEN0*)0xFB010010u)

/** \brief 14, EMEM Module Access Enable Register 1 */
#define EMEMMPU1_ACCEN1 /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_ACCEN1*)0xFB010014u)

/** \brief 20, EMEM Module Memory Control Register */
#define EMEMMPU1_MEMCON /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_MEMCON*)0xFB010020u)

/** \brief 24, EMEM Module Safety Control Register */
#define EMEMMPU1_SCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_SCTRL*)0xFB010024u)

/** \brief 50, EMEM Module Region i Lower Address Register */
#define EMEMMPU1_RGNWRN0_RGNLA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNLA*)0xFB010050u)
/** Alias (User Manual Name) for EMEMMPU1_RGNWRN0_RGNLA.
* To use register names with standard convension, please use EMEMMPU1_RGNWRN0_RGNLA.
*/
#define EMEMMPU1_RGNLA0 (EMEMMPU1_RGNWRN0_RGNLA)

/** \brief 54, EMEM Module Region i Upper Address Register */
#define EMEMMPU1_RGNWRN0_RGNUA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNUA*)0xFB010054u)
/** Alias (User Manual Name) for EMEMMPU1_RGNWRN0_RGNUA.
* To use register names with standard convension, please use EMEMMPU1_RGNWRN0_RGNUA.
*/
#define EMEMMPU1_RGNUA0 (EMEMMPU1_RGNWRN0_RGNUA)

/** \brief 58, EMEM Module Region i Write Access Enable Register 0 */
#define EMEMMPU1_RGNWRN0_RGNACCENWA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNACCENWA*)0xFB010058u)
/** Alias (User Manual Name) for EMEMMPU1_RGNWRN0_RGNACCENWA.
* To use register names with standard convension, please use EMEMMPU1_RGNWRN0_RGNACCENWA.
*/
#define EMEMMPU1_RGNACCENWA0 (EMEMMPU1_RGNWRN0_RGNACCENWA)

/** \brief 5C, EMEM Module Region i Write Access Enable Register 1 */
#define EMEMMPU1_RGNWRN0_RGNACCENWB /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNACCENWB*)0xFB01005Cu)
/** Alias (User Manual Name) for EMEMMPU1_RGNWRN0_RGNACCENWB.
* To use register names with standard convension, please use EMEMMPU1_RGNWRN0_RGNACCENWB.
*/
#define EMEMMPU1_RGNACCENWB0 (EMEMMPU1_RGNWRN0_RGNACCENWB)

/** \brief 60, EMEM Module Region i Lower Address Register */
#define EMEMMPU1_RGNWRN1_RGNLA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNLA*)0xFB010060u)
/** Alias (User Manual Name) for EMEMMPU1_RGNWRN1_RGNLA.
* To use register names with standard convension, please use EMEMMPU1_RGNWRN1_RGNLA.
*/
#define EMEMMPU1_RGNLA1 (EMEMMPU1_RGNWRN1_RGNLA)

/** \brief 64, EMEM Module Region i Upper Address Register */
#define EMEMMPU1_RGNWRN1_RGNUA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNUA*)0xFB010064u)
/** Alias (User Manual Name) for EMEMMPU1_RGNWRN1_RGNUA.
* To use register names with standard convension, please use EMEMMPU1_RGNWRN1_RGNUA.
*/
#define EMEMMPU1_RGNUA1 (EMEMMPU1_RGNWRN1_RGNUA)

/** \brief 68, EMEM Module Region i Write Access Enable Register 0 */
#define EMEMMPU1_RGNWRN1_RGNACCENWA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNACCENWA*)0xFB010068u)
/** Alias (User Manual Name) for EMEMMPU1_RGNWRN1_RGNACCENWA.
* To use register names with standard convension, please use EMEMMPU1_RGNWRN1_RGNACCENWA.
*/
#define EMEMMPU1_RGNACCENWA1 (EMEMMPU1_RGNWRN1_RGNACCENWA)

/** \brief 6C, EMEM Module Region i Write Access Enable Register 1 */
#define EMEMMPU1_RGNWRN1_RGNACCENWB /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNACCENWB*)0xFB01006Cu)
/** Alias (User Manual Name) for EMEMMPU1_RGNWRN1_RGNACCENWB.
* To use register names with standard convension, please use EMEMMPU1_RGNWRN1_RGNACCENWB.
*/
#define EMEMMPU1_RGNACCENWB1 (EMEMMPU1_RGNWRN1_RGNACCENWB)

