zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxEmem_mpu_reg.h
/** \brief 70, EMEM Module Region i Lower Address Register */
#define EMEMMPU3_RGNWRN2_RGNLA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNLA*)0xFB030070u)
/** Alias (User Manual Name) for EMEMMPU3_RGNWRN2_RGNLA.
* To use register names with standard convension, please use EMEMMPU3_RGNWRN2_RGNLA.
*/
#define EMEMMPU3_RGNLA2 (EMEMMPU3_RGNWRN2_RGNLA)

/** \brief 74, EMEM Module Region i Upper Address Register */
#define EMEMMPU3_RGNWRN2_RGNUA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNUA*)0xFB030074u)
/** Alias (User Manual Name) for EMEMMPU3_RGNWRN2_RGNUA.
* To use register names with standard convension, please use EMEMMPU3_RGNWRN2_RGNUA.
*/
#define EMEMMPU3_RGNUA2 (EMEMMPU3_RGNWRN2_RGNUA)

/** \brief 78, EMEM Module Region i Write Access Enable Register 0 */
#define EMEMMPU3_RGNWRN2_RGNACCENWA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNACCENWA*)0xFB030078u)
/** Alias (User Manual Name) for EMEMMPU3_RGNWRN2_RGNACCENWA.
* To use register names with standard convension, please use EMEMMPU3_RGNWRN2_RGNACCENWA.
*/
#define EMEMMPU3_RGNACCENWA2 (EMEMMPU3_RGNWRN2_RGNACCENWA)

/** \brief 7C, EMEM Module Region i Write Access Enable Register 1 */
#define EMEMMPU3_RGNWRN2_RGNACCENWB /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNACCENWB*)0xFB03007Cu)
/** Alias (User Manual Name) for EMEMMPU3_RGNWRN2_RGNACCENWB.
* To use register names with standard convension, please use EMEMMPU3_RGNWRN2_RGNACCENWB.
*/
#define EMEMMPU3_RGNACCENWB2 (EMEMMPU3_RGNWRN2_RGNACCENWB)

/** \brief 80, EMEM Module Region i Lower Address Register */
#define EMEMMPU3_RGNWRN3_RGNLA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNLA*)0xFB030080u)
/** Alias (User Manual Name) for EMEMMPU3_RGNWRN3_RGNLA.
* To use register names with standard convension, please use EMEMMPU3_RGNWRN3_RGNLA.
*/
#define EMEMMPU3_RGNLA3 (EMEMMPU3_RGNWRN3_RGNLA)

/** \brief 84, EMEM Module Region i Upper Address Register */
#define EMEMMPU3_RGNWRN3_RGNUA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNUA*)0xFB030084u)
/** Alias (User Manual Name) for EMEMMPU3_RGNWRN3_RGNUA.
* To use register names with standard convension, please use EMEMMPU3_RGNWRN3_RGNUA.
*/
#define EMEMMPU3_RGNUA3 (EMEMMPU3_RGNWRN3_RGNUA)

/** \brief 88, EMEM Module Region i Write Access Enable Register 0 */
#define EMEMMPU3_RGNWRN3_RGNACCENWA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNACCENWA*)0xFB030088u)
/** Alias (User Manual Name) for EMEMMPU3_RGNWRN3_RGNACCENWA.
* To use register names with standard convension, please use EMEMMPU3_RGNWRN3_RGNACCENWA.
*/
#define EMEMMPU3_RGNACCENWA3 (EMEMMPU3_RGNWRN3_RGNACCENWA)

/** \brief 8C, EMEM Module Region i Write Access Enable Register 1 */
#define EMEMMPU3_RGNWRN3_RGNACCENWB /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNACCENWB*)0xFB03008Cu)
/** Alias (User Manual Name) for EMEMMPU3_RGNWRN3_RGNACCENWB.
* To use register names with standard convension, please use EMEMMPU3_RGNWRN3_RGNACCENWB.
*/
#define EMEMMPU3_RGNACCENWB3 (EMEMMPU3_RGNWRN3_RGNACCENWB)

/** \brief 90, EMEM Module Region i Lower Address Register */
#define EMEMMPU3_RGNWRN4_RGNLA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNLA*)0xFB030090u)
/** Alias (User Manual Name) for EMEMMPU3_RGNWRN4_RGNLA.
* To use register names with standard convension, please use EMEMMPU3_RGNWRN4_RGNLA.
*/
#define EMEMMPU3_RGNLA4 (EMEMMPU3_RGNWRN4_RGNLA)

/** \brief 94, EMEM Module Region i Upper Address Register */
#define EMEMMPU3_RGNWRN4_RGNUA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNUA*)0xFB030094u)
/** Alias (User Manual Name) for EMEMMPU3_RGNWRN4_RGNUA.
* To use register names with standard convension, please use EMEMMPU3_RGNWRN4_RGNUA.
*/
#define EMEMMPU3_RGNUA4 (EMEMMPU3_RGNWRN4_RGNUA)

/** \brief 98, EMEM Module Region i Write Access Enable Register 0 */
#define EMEMMPU3_RGNWRN4_RGNACCENWA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNACCENWA*)0xFB030098u)
/** Alias (User Manual Name) for EMEMMPU3_RGNWRN4_RGNACCENWA.
* To use register names with standard convension, please use EMEMMPU3_RGNWRN4_RGNACCENWA.
*/
#define EMEMMPU3_RGNACCENWA4 (EMEMMPU3_RGNWRN4_RGNACCENWA)

/** \brief 9C, EMEM Module Region i Write Access Enable Register 1 */
#define EMEMMPU3_RGNWRN4_RGNACCENWB /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNACCENWB*)0xFB03009Cu)
/** Alias (User Manual Name) for EMEMMPU3_RGNWRN4_RGNACCENWB.
* To use register names with standard convension, please use EMEMMPU3_RGNWRN4_RGNACCENWB.
*/
#define EMEMMPU3_RGNACCENWB4 (EMEMMPU3_RGNWRN4_RGNACCENWB)

/** \brief A0, EMEM Module Region i Lower Address Register */
#define EMEMMPU3_RGNWRN5_RGNLA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNLA*)0xFB0300A0u)
/** Alias (User Manual Name) for EMEMMPU3_RGNWRN5_RGNLA.
* To use register names with standard convension, please use EMEMMPU3_RGNWRN5_RGNLA.
*/
#define EMEMMPU3_RGNLA5 (EMEMMPU3_RGNWRN5_RGNLA)

/** \brief A4, EMEM Module Region i Upper Address Register */
#define EMEMMPU3_RGNWRN5_RGNUA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNUA*)0xFB0300A4u)
/** Alias (User Manual Name) for EMEMMPU3_RGNWRN5_RGNUA.
* To use register names with standard convension, please use EMEMMPU3_RGNWRN5_RGNUA.
*/
#define EMEMMPU3_RGNUA5 (EMEMMPU3_RGNWRN5_RGNUA)

/** \brief A8, EMEM Module Region i Write Access Enable Register 0 */
#define EMEMMPU3_RGNWRN5_RGNACCENWA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNACCENWA*)0xFB0300A8u)
/** Alias (User Manual Name) for EMEMMPU3_RGNWRN5_RGNACCENWA.
* To use register names with standard convension, please use EMEMMPU3_RGNWRN5_RGNACCENWA.
*/
#define EMEMMPU3_RGNACCENWA5 (EMEMMPU3_RGNWRN5_RGNACCENWA)

/** \brief AC, EMEM Module Region i Write Access Enable Register 1 */
#define EMEMMPU3_RGNWRN5_RGNACCENWB /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNACCENWB*)0xFB0300ACu)
/** Alias (User Manual Name) for EMEMMPU3_RGNWRN5_RGNACCENWB.
* To use register names with standard convension, please use EMEMMPU3_RGNWRN5_RGNACCENWB.
*/
#define EMEMMPU3_RGNACCENWB5 (EMEMMPU3_RGNWRN5_RGNACCENWB)

/** \brief B0, EMEM Module Region i Lower Address Register */
#define EMEMMPU3_RGNWRN6_RGNLA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNLA*)0xFB0300B0u)
/** Alias (User Manual Name) for EMEMMPU3_RGNWRN6_RGNLA.
* To use register names with standard convension, please use EMEMMPU3_RGNWRN6_RGNLA.
*/
#define EMEMMPU3_RGNLA6 (EMEMMPU3_RGNWRN6_RGNLA)

/** \brief B4, EMEM Module Region i Upper Address Register */
#define EMEMMPU3_RGNWRN6_RGNUA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNUA*)0xFB0300B4u)
/** Alias (User Manual Name) for EMEMMPU3_RGNWRN6_RGNUA.
* To use register names with standard convension, please use EMEMMPU3_RGNWRN6_RGNUA.
*/
#define EMEMMPU3_RGNUA6 (EMEMMPU3_RGNWRN6_RGNUA)

/** \brief B8, EMEM Module Region i Write Access Enable Register 0 */
#define EMEMMPU3_RGNWRN6_RGNACCENWA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNACCENWA*)0xFB0300B8u)
/** Alias (User Manual Name) for EMEMMPU3_RGNWRN6_RGNACCENWA.
* To use register names with standard convension, please use EMEMMPU3_RGNWRN6_RGNACCENWA.
*/
#define EMEMMPU3_RGNACCENWA6 (EMEMMPU3_RGNWRN6_RGNACCENWA)

/** \brief BC, EMEM Module Region i Write Access Enable Register 1 */
#define EMEMMPU3_RGNWRN6_RGNACCENWB /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNACCENWB*)0xFB0300BCu)
/** Alias (User Manual Name) for EMEMMPU3_RGNWRN6_RGNACCENWB.
* To use register names with standard convension, please use EMEMMPU3_RGNWRN6_RGNACCENWB.
*/
#define EMEMMPU3_RGNACCENWB6 (EMEMMPU3_RGNWRN6_RGNACCENWB)

