zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxEmem_mpu_reg.h
/** \brief 12C, EMEM Module Region i Read Access Enable Register 1 */
#define EMEMMPU3_RGNACCEN5_RGNACCENRB /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB*)0xFB03012Cu)
/** Alias (User Manual Name) for EMEMMPU3_RGNACCEN5_RGNACCENRB.
* To use register names with standard convension, please use EMEMMPU3_RGNACCEN5_RGNACCENRB.
*/
#define EMEMMPU3_RGNACCENRB5 (EMEMMPU3_RGNACCEN5_RGNACCENRB)

/** \brief 138, EMEM Module Region i Read Access Enable Register 0 */
#define EMEMMPU3_RGNACCEN6_RGNACCENRA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA*)0xFB030138u)
/** Alias (User Manual Name) for EMEMMPU3_RGNACCEN6_RGNACCENRA.
* To use register names with standard convension, please use EMEMMPU3_RGNACCEN6_RGNACCENRA.
*/
#define EMEMMPU3_RGNACCENRA6 (EMEMMPU3_RGNACCEN6_RGNACCENRA)

/** \brief 13C, EMEM Module Region i Read Access Enable Register 1 */
#define EMEMMPU3_RGNACCEN6_RGNACCENRB /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB*)0xFB03013Cu)
/** Alias (User Manual Name) for EMEMMPU3_RGNACCEN6_RGNACCENRB.
* To use register names with standard convension, please use EMEMMPU3_RGNACCEN6_RGNACCENRB.
*/
#define EMEMMPU3_RGNACCENRB6 (EMEMMPU3_RGNACCEN6_RGNACCENRB)

/** \brief 148, EMEM Module Region i Read Access Enable Register 0 */
#define EMEMMPU3_RGNACCEN7_RGNACCENRA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA*)0xFB030148u)
/** Alias (User Manual Name) for EMEMMPU3_RGNACCEN7_RGNACCENRA.
* To use register names with standard convension, please use EMEMMPU3_RGNACCEN7_RGNACCENRA.
*/
#define EMEMMPU3_RGNACCENRA7 (EMEMMPU3_RGNACCEN7_RGNACCENRA)

/** \brief 14C, EMEM Module Region i Read Access Enable Register 1 */
#define EMEMMPU3_RGNACCEN7_RGNACCENRB /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB*)0xFB03014Cu)
/** Alias (User Manual Name) for EMEMMPU3_RGNACCEN7_RGNACCENRB.
* To use register names with standard convension, please use EMEMMPU3_RGNACCEN7_RGNACCENRB.
*/
#define EMEMMPU3_RGNACCENRB7 (EMEMMPU3_RGNACCEN7_RGNACCENRB)


/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXEMEM_MPU_REG_H */
